app/controllers/parts_controller.rb

  def show
    @part = Part.find(params[:id])
---
SELECT  "parts".* FROM "parts"  WHERE "parts"."id" = ? LIMIT 1  [["id", 0]]